wrk_out
Running 2m test @ http://localhost:50000
  100 threads and 400 connections
  Thread calibration: mean lat.: 5.377ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 5.175ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 5.083ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 5.438ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.100ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.158ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.730ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 6.880ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 6.890ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 6.403ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 6.810ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 6.919ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 7.190ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 7.847ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 7.004ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 7.199ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 8.487ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 8.287ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 8.401ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 8.537ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 9.702ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 9.048ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 8.823ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 9.552ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 9.754ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 10.544ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 10.444ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 9.861ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 10.571ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 10.140ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 11.521ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 10.921ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 11.461ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 11.054ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 11.175ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 11.600ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 11.225ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 12.350ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 12.583ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 12.536ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 12.208ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 12.743ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 13.886ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 13.647ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 13.755ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 13.241ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 13.637ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 13.624ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 13.166ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 14.764ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 14.131ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 14.962ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 14.407ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 14.900ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 14.658ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 15.273ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 15.751ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 15.070ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 15.507ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 15.754ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 15.651ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 16.239ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 15.879ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 16.405ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 16.507ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 16.641ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 16.284ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 16.577ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 16.590ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 16.237ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 17.686ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 16.812ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 17.319ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 17.781ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 17.557ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 17.390ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 17.135ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 17.615ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 17.596ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 18.803ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 17.822ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 18.547ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 18.749ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 18.728ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 18.827ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 18.518ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 18.137ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 18.200ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 17.778ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 18.180ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 18.603ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 19.469ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 19.782ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 19.054ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 19.641ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 19.751ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 19.371ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 19.798ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 19.619ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 19.883ms, rate sampling interval: 49ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.11ms    8.73ms  60.38ms   62.70%
    Req/Sec    10.06     25.49   200.00     87.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.51ms
 75.000%   17.12ms
 90.000%   24.69ms
 99.000%   33.95ms
 99.900%   56.74ms
 99.990%   59.74ms
 99.999%   60.16ms
100.000%   60.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.141     0.000000            1         1.00
       1.480     0.100000        10988         1.11
       3.157     0.200000        21964         1.25
       5.855     0.300000        32947         1.43
       8.735     0.400000        43935         1.67
      11.511     0.500000        54916         2.00
      12.783     0.550000        60423         2.22
      13.879     0.600000        65885         2.50
      14.871     0.650000        71362         2.86
      15.935     0.700000        76852         3.33
      17.119     0.750000        82391         4.00
      17.855     0.775000        85132         4.44
      18.815     0.800000        87827         5.00
      20.159     0.825000        90604         5.71
      21.711     0.850000        93321         6.67
      23.215     0.875000        96082         8.00
      23.919     0.887500        97454         8.89
      24.687     0.900000        98834        10.00
      25.567     0.912500       100186        11.43
      26.559     0.925000       101562        13.33
      27.551     0.937500       102932        16.00
      28.079     0.943750       103610        17.78
      28.639     0.950000       104293        20.00
      29.167     0.956250       105001        22.86
      29.679     0.962500       105685        26.67
      30.223     0.968750       106359        32.00
      30.575     0.971875       106709        35.56
      30.911     0.975000       107049        40.00
      31.279     0.978125       107384        45.71
      31.759     0.981250       107727        53.33
      32.255     0.984375       108075        64.00
      32.559     0.985938       108240        71.11
      33.055     0.987500       108418        80.00
      33.599     0.989062       108585        91.43
      34.175     0.990625       108753       106.67
      34.879     0.992188       108931       128.00
      35.359     0.992969       109013       142.22
      35.743     0.993750       109100       160.00
      36.319     0.994531       109182       182.86
      36.863     0.995313       109268       213.33
      37.599     0.996094       109354       256.00
      38.079     0.996484       109402       284.44
      38.431     0.996875       109439       320.00
      38.815     0.997266       109482       365.71
      39.679     0.997656       109525       426.67
      40.959     0.998047       109568       512.00
      41.663     0.998242       109590       568.89
      42.527     0.998437       109611       640.00
      46.271     0.998633       109632       731.43
      55.615     0.998828       109654       853.33
      56.831     0.999023       109675      1024.00
      57.215     0.999121       109686      1137.78
      57.727     0.999219       109697      1280.00
      58.175     0.999316       109707      1462.86
      58.591     0.999414       109718      1706.67
      58.847     0.999512       109731      2048.00
      58.911     0.999561       109734      2275.56
      59.039     0.999609       109740      2560.00
      59.071     0.999658       109745      2925.71
      59.167     0.999707       109750      3413.33
      59.295     0.999756       109756      4096.00
      59.359     0.999780       109760      4551.11
      59.423     0.999805       109761      5120.00
      59.487     0.999829       109764      5851.43
      59.551     0.999854       109766      6826.67
      59.615     0.999878       109769      8192.00
      59.679     0.999890       109770      9102.22
      59.807     0.999902       109772     10240.00
      59.871     0.999915       109773     11702.86
      59.999     0.999927       109774     13653.33
      60.031     0.999939       109776     16384.00
      60.031     0.999945       109776     18204.44
      60.063     0.999951       109777     20480.00
      60.095     0.999957       109778     23405.71
      60.095     0.999963       109778     27306.67
      60.159     0.999969       109781     32768.00
      60.159     0.999973       109781     36408.89
      60.159     0.999976       109781     40960.00
      60.159     0.999979       109781     46811.43
      60.159     0.999982       109781     54613.33
      60.159     0.999985       109781     65536.00
      60.159     0.999986       109781     72817.78
      60.159     0.999988       109781     81920.00
      60.159     0.999989       109781     93622.86
      60.159     0.999991       109781    109226.67
      60.415     0.999992       109782    131072.00
      60.415     1.000000       109782          inf
#[Mean    =       12.111, StdDeviation   =        8.729]
#[Max     =       60.384, Total count    =       109782]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   10.78ms
 75.000%   16.35ms
 90.000%   23.95ms
 99.000%   33.25ms
 99.900%   56.19ms
 99.990%   58.75ms
 99.999%   58.97ms
100.000%   59.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.097     0.000000            1         1.00
       0.727     0.100000        10983         1.11
       2.447     0.200000        21963         1.25
       5.159     0.300000        32937         1.43
       8.019     0.400000        43917         1.67
      10.783     0.500000        54901         2.00
      12.079     0.550000        60384         2.22
      13.167     0.600000        65874         2.50
      14.143     0.650000        71378         2.86
      15.207     0.700000        76857         3.33
      16.351     0.750000        82340         4.00
      17.103     0.775000        85129         4.44
      18.111     0.800000        87853         5.00
      19.439     0.825000        90583         5.71
      21.007     0.850000        93345         6.67
      22.511     0.875000        96082         8.00
      23.151     0.887500        97460         8.89
      23.951     0.900000        98818        10.00
      24.863     0.912500       100190        11.43
      25.823     0.925000       101572        13.33
      26.799     0.937500       102925        16.00
      27.359     0.943750       103607        17.78
      27.935     0.950000       104306        20.00
      28.431     0.956250       104998        22.86
      28.943     0.962500       105680        26.67
      29.487     0.968750       106366        32.00
      29.807     0.971875       106703        35.56
      30.175     0.975000       107053        40.00
      30.495     0.978125       107390        45.71
      30.991     0.981250       107733        53.33
      31.535     0.984375       108076        64.00
      31.807     0.985938       108243        71.11
      32.239     0.987500       108413        80.00
      32.895     0.989062       108590        91.43
      33.471     0.990625       108757       106.67
      34.047     0.992188       108929       128.00
      34.623     0.992969       109015       142.22
      34.943     0.993750       109096       160.00
      35.743     0.994531       109183       182.86
      36.127     0.995313       109273       213.33
      36.831     0.996094       109357       256.00
      37.407     0.996484       109398       284.44
      37.727     0.996875       109445       320.00
      37.919     0.997266       109484       365.71
      38.911     0.997656       109525       426.67
      40.223     0.998047       109569       512.00
      40.831     0.998242       109591       568.89
      41.919     0.998437       109612       640.00
      45.631     0.998633       109632       731.43
      55.007     0.998828       109654       853.33
      56.319     0.999023       109677      1024.00
      56.607     0.999121       109686      1137.78
      57.183     0.999219       109697      1280.00
      57.567     0.999316       109707      1462.86
      57.983     0.999414       109719      1706.67
      58.335     0.999512       109730      2048.00
      58.367     0.999561       109734      2275.56
      58.431     0.999609       109746      2560.00
      58.431     0.999658       109746      2925.71
      58.527     0.999707       109753      3413.33
      58.559     0.999756       109757      4096.00
      58.591     0.999780       109761      4551.11
      58.591     0.999805       109761      5120.00
      58.623     0.999829       109764      5851.43
      58.687     0.999854       109769      6826.67
      58.687     0.999878       109769      8192.00
      58.719     0.999890       109770      9102.22
      58.751     0.999902       109772     10240.00
      58.783     0.999915       109774     11702.86
      58.783     0.999927       109774     13653.33
      58.847     0.999939       109777     16384.00
      58.847     0.999945       109777     18204.44
      58.847     0.999951       109777     20480.00
      58.911     0.999957       109779     23405.71
      58.911     0.999963       109779     27306.67
      58.911     0.999969       109779     32768.00
      58.911     0.999973       109779     36408.89
      58.943     0.999976       109780     40960.00
      58.943     0.999979       109780     46811.43
      58.943     0.999982       109780     54613.33
      58.975     0.999985       109781     65536.00
      58.975     0.999986       109781     72817.78
      58.975     0.999988       109781     81920.00
      58.975     0.999989       109781     93622.86
      58.975     0.999991       109781    109226.67
      59.039     0.999992       109782    131072.00
      59.039     1.000000       109782          inf
#[Mean    =       11.406, StdDeviation   =        8.707]
#[Max     =       59.008, Total count    =       109782]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  120100 requests in 2.00m, 154.28MB read
Requests/sec:   1000.81
Transfer/sec:      1.29MB